tutorials/RAS/withoutHumidity/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    walls
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    inletTop
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.001;
        value           uniform 0.1;
    }

    inletBottom
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.001;
        value           uniform 0.1;
    }

    outletTop
    {
        type            zeroGradient;
    }

    outletBottom
    {
        type            zeroGradient;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}


// ************************************************************************* //
